run/secondary_breakup/secondaryBreakupFeTest/constant/species
species
(
	N2
	Fe
);

reactions
{}
